
// เลื่อนตัวอย่างคำถาม

var slider_img = document.querySelector('.slider-img');
var images = ['chris.jpeg', 'Elon.png', 'sport.png', 'plant.png'];
var texts = ['“การแสดงดนตรีในสภาวะไร้น้ำหนักเป็นอย่างไร”', 
                '"เราจะปกครองแบบไหนกันบนดาวอังคาร"', 
                '"การเล่นกีฬาบนอวกาศจะเป็นอย่างไร"', 
                '"สามารถปลูกพืชบนอวกาศได้ไหม"'];
var contents = [`คงเป็นไปไม่ได้ที่จะได้ยินเสียงใด ๆ บนอวกาศ เพราะอวกาศไม่มีตัวกลางในการส่งผ่านคลื่นเสียง<br/>แต่บนสถานีอวกาศนานาชาติมีอากาศ โดยมีนักบินชื่อ Chris Hadfield<br/>ได้บรรเลงเพลง "Space Oddity" บนสถานีอวกาศมาแล้ว`, 
                    `เราจะตั้งอาณานิคมกันอย่างไรบนดาวอังคาร ปัจจุบันได้เริ่มมีโครงการต่าง ๆ<br/>ที่ชี้ชัดถึงการที่มนุษย์จะนำอารยธรรมของตัวเองไปตั้งอยู่ที่นั่น<br/>ตัวอย่างเช่น โครงการ SpaceX ของ Elon Musk`, 
                    `แม้ปกติมนุษย์เราจะเล่นกีฬาภายใต้แรงโน้มถ่วงมาตตลอด<br/>แต่การออกกำลังกายก็เป็นสิ่งที่จำเป็นของนักบินอวกาศ<br/>เหล่านักบินอวกาศจึงพยายามคิดค้นหากิจกรรมที่สนุก และตื่นเต้นกว่าการออกกำัลังกายปกติ`, 
                    'จากการทดลองปลูกพืชในอวกาศหลายต่อหลายครั้ง<br/>ทำให้ค้นพบว่า แรงโน้มถ่วงเป็นปัจจัยที่ส่งผลต่อการงอกแต่ไม่ได้จำเป็น<br/>กล่าวคือ พืชสามารถอยู่ได้แม้ไม่มีแรงโน้มถ่วง และมันจะงอกตามสิ่งเร้าอย่างอื่นอย่างน้ำและแสงแทน'];
var link = [`https://today.line.me/th/v2/article/MQRyo0`, `https://www.tnnthailand.com/news/world/61821/`, `https://www.mainstand.co.th/344`, `https://spaceth.co/plants-in-space/`];
var i = 0;

function prev(){
	if(i <= 0) i = images.length;	
	i--;
	return setImg(), setText();			 
}

function next(){
	if(i >= images.length-1) i = -1;
	i++;
	return setImg(), setText();			 
}

function setImg(){
	return slider_img.setAttribute('src', "image/"+images[i]);
	
}

function setText(){
    return document.getElementById("slider_title").innerHTML = texts[i], document.getElementById("slider_content").innerHTML = contents[i], document.getElementById("slider_link").setAttribute('href', link[i]);
}

// เลื่อนวิธีเข้าถึงอวกาศ
var j = 0;

var text = [`ต้องทำการหลอมรวมศาสตร์ต่าง ๆ เข้าด้วยกัน`, `ต้องทำการออกแบบเครื่องมือ, ประสบการณ์,<br/>การเข้าถึงอวกาศสำหรับทุกคน`, `ต้องส่งเสริมโอกาสให้ไอเดียจากคนหลากหลาย<br/>กลุ่มได้เข้ามาพัฒนางานของเรา`];
var content = [`คือการไม่ปิดกั้นระหว่างสาขาและความเชี่ยวชาญในศาสตร์ต่าง ๆ<br/>สิ่งที่ปิดกั้นเรา (จากความสร้างสรรค์) คือการที่เรามีพื้นหลังมาจาก<br/>ฝั่งสายงานด้านวิศวกรรมและฟิสิกส์ดาราศาสตร์ `, 
                `ณ ปัจจุบันยังจำกัดอยู่แค่กับคนไม่กี่กลุ่ม แต่ถ้าเราต้องการให้อวกาศ<br/>เป็นเรื่องของทุกคน ประสบการณ์ การเข้าถึง จะต้องเข้าถึงได้ทุกคนจริง ๆ<br/>ซึ่งเราต้องคิดไว้เสมอว่า ทุกคนบนโลกต้องมีพื้นที่ของเขาบนอวกาศ`, 
                `เปิดโอกาสให้ทุกคนได้เข้าถึงทรัพยากร เช่น ระบบ Cloud Computing<br/>คือ ทุกคนไม่ต้องมีคอมพิวเตอร์แรง ๆ เป็นของตัวเอง แต่ถ้าต้องใช้งาน<br/>การประมวลผลหนัก ๆ สามารถโยนข้อมูลเช้ามาประมวลในคอมพิวเตอร์<br/>ส่วนกลางและจ่ายเงินแค่เท่าที่ใช้ได้ ดังนั้นในอนาคต ถ้าจะต้องมีการเปิด<br/>ให้เข้าถึงอวกาศ การเกิดขึ้นของ Platform สำหรับการทดลองไอเดีย`];
function next_text() {
    if (j >= 2) j =-1;
    j++;
    return document.getElementById("slider_text_title").innerHTML = text[j], document.getElementById("slider_text_content").innerHTML = content[j];
}
